[
    {
        "id": "1",
        "rating": {
            "number": 5,
            "badge": "Excellent"
        },
        "name": "C-Programming",
        "total_student": 12875,
        "title": "The C Programming Language",
        "instructor": {
            "name": "Borhanul Islam",
            "published_date": "2022-10-26 17:27:34",
            "img": "https://cdn2.vectorstock.com/i/1000x1000/93/96/boy-anime-male-manga-cartoon-icon-graphic-vector-10099396.jpg"
        },
        "class_time": "9 pm to 11 pm",
        "price" : "$120",
        "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/35/The_C_Programming_Language_logo.svg/640px-The_C_Programming_Language_logo.svg.png",
        "details": "C is a powerful general-purpose programming language. It can be used to develop software like operating systems, databases, compilers, and so on. C programming is an excellent language to learn to program for beginners.C is an imperative procedural language supporting structured programming, lexical variable scope, and recursion, with a static type system. It was designed to be compiled to provide low-level access to memory and language constructs that map efficiently to machine instructions, all with minimal runtime support. Despite its low-level capabilities, the language was designed to encourage cross-platform programming. A standards-compliant C program written with portability in mind can be compiled for a wide variety of computer platforms and operating systems with few changes to its source code."
    },
    {
        "id": "2",
        "rating": {
            "number": 5,
            "badge": "Excellent"
        },
        "name": "Python",
        "total_student": 10875,
        "title": "Python - Something Difference.",
        "instructor": {
            "name": "Hasib Sifat",
            "published_date": "2022-10-20 17:27:34",
            "img": "https://i.pinimg.com/736x/13/ed/e5/13ede50f174dea64a06479ee2d5c4a66.jpg"
        },
        "class_time": "7 pm to 9 pm",
        "price" : "$120",
        "image_url": "https://contentstatic.techgig.com/photo/79386213/5-myths-around-python-programming-language-that-every-programmer-must-know.jpg?88712",
        "details": "Python is a very popular general-purpose interpreted, interactive, object-oriented, and high-level programming language. Python is dynamically-typed and garbage-collected programming language. It was created by Guido van Rossum during 1985- 1990. Like Perl, Python source code is also available under the GNU General Public License (GPL).Today, Python is very high in demand and all the major companies are looking for great Python Programmers to develop websites, software components, and applications or to work with Data Science, AI, and ML technologies. When we are developing this tutorial in 2022, there is a high shortage of Python Programmers where as market demands more number of Python Programmers due to it's application in Machine Learning, Artificial Intelligence etc."
    },
    {
        "id": "3",
        "rating": {
            "number": 4.5,
            "badge": "Excellent"
        },
        "name": "C++",
        "total_student": 14892,
        "title": "C++",
        "instructor": {
            "name": "Partho",
            "published_date": "2022-11-01 17:27:34",
            "img": "https://img1.picmix.com/output/stamp/normal/2/3/6/2/1932632_50e25.png"
        },
        "class_time": "7 pm to 9 pm",
        "price" : "$120",
        "image_url": "https://bs-uploads.toptal.io/blackfish-uploads/components/blog_post_page/content/cover_image_file/cover_image/1080335/retina_1708x683_cover-0325-LearnCandC__Languages_Dan_Newsletter-743100f051077054fa1cc613ff4523a2.png",
        "details": "C++ is an object-oriented programming language which gives a clear structure to programs and allows code to be reused, lowering development costs. C++ is portable and can be used to develop applications that can be adapted to multiple platforms.C++ is a MUST for students and working professionals to become a great Software Engineer. I will list down some of the key advantages of learning C++ .C++ is very close to hardware, so you get a chance to work at a low level which gives you lot of control in terms of memory management, better performance and finally a robust software development.C++ programming gives you a clear understanding about Object Oriented Programming. You will understand low level implementation of polymorphism when you will implement virtual tables and virtual table pointers, or dynamic type identification."
    },
    {
        "id": "4",
        "rating": {
            "number": 5,
            "badge": "Excellent"
        },
        "name": "Javascript",
        "total_student": 20589,
        "title": "JavaScript - Create awesome sites.",
        "instructor": {
            "name": "Jannatut Tuba",
            "published_date": "2022-10-01 17:27:34",
            "img": "https://i.pinimg.com/736x/3a/58/87/3a5887cf44f3b986296e605fb929c8f2.jpg"
        },
        "class_time": "8 pm to 10 pm",
        "price" : "$120",
        "image_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRv8yJaxP10--lzBgC0oY_8YS4vAWW0K7b_Ow&usqp=CAU",
        "details": "JavaScript is the world's most popular programming language. JavaScript is the programming language of the Web. JavaScript is easy to learn.JavaScript, often abbreviated as JS, is a programming language that is one of the core technologies of the World Wide Web, alongside HTML and CSS. As of 2022, 98% of websites use JavaScript on the client side for webpage behavior, often incorporating third-party libraries.JavaScript (js) is a light-weight object-oriented programming language which is used by several websites for scripting the webpages. "
    },
    {
        "id": "5",
        "rating": {
            "number": 4.8,
            "badge": "Excellent"
        },
        "name": "Java",
        "total_student": 10589,
        "title": "Java",
        "instructor": {
            "name": "Sakib Hasan",
            "published_date": "2022-11-01 17:27:34",
            "img": "https://i.redd.it/8wwvgmpcxb601.jpg"
        },
        "class_time": "8 pm to 10 pm",
        "price" : "$120",
        "image_url": "https://3.bp.blogspot.com/-enXse4F7t94/U5hpR5fivsI/AAAAAAAABl8/n6Pc81-GYno/s1600/Java+logo+good.png",
        "details": "Java is a high-level, class-based, object-oriented programming language that is designed to have as few implementation dependencies as possible. Java is a programming language and a platform. Java is a high level, robust, object-oriented and secure programming language. Learn the Java programming language in this complete beginner's course.  "
    },
    {
        "id": "6",
        "rating": {
            "number": 4.5,
            "badge": "Excellent"
        },
        "name": "PHP",
        "total_student": 8536,
        "title": "PHP",
        "instructor": {
            "name": "Sabikunnahar",
            "published_date": "2022-10-01 17:27:34",
            "img": "https://img.freepik.com/premium-vector/anime-girl-character_146237-78.jpg?w=2000"
        },
        "class_time": "9 pm to 11 pm",
        "price" : "$120",
        "image_url": "https://concatenate.io/wp-content/uploads/2021/07/php-language.jpeg",
        "details": "PHP is a general-purpose scripting language geared toward web development. It was originally created by Danish-Canadian programmer Rasmus Lerdorf in 1993. The PHP reference implementation is now produced by The PHP Group. PHP is a server side scripting language that is embedded in HTML. It is used to manage dynamic content, databases, session tracking, even build entire e-commerce sites. "
    }

    

]